curso/app/controllers/duvidas_controller.rb

  def enviar
    if(request.post?)
      form_duvida = params[:duvida]
      duvida = Duvida.new(form_duvida)
      duvida.exemplo_id = params[:id]
      if(duvida.save)
---
INSERT INTO "duvidas" ("created_at", "exemplo_id", "nome", "updated_at", "duvida", "email") VALUES('2009-10-14 19:00:45', NULL, '', '2009-10-14 19:00:45', '', '')