curso/app/controllers/exemplos_controller.rb

SELECT * FROM "exemplos"
---
  def index
    @exemplos = Exemplo.all

SELECT * FROM "exemplos" WHERE ("exemplos"."id" = 1)
---
  def show
    @exemplo = Exemplo.find(params[:id])

SELECT * FROM "exemplos" WHERE ("exemplos"."id" = 1)
---
  def edit
    @exemplo = Exemplo.find(params[:id])

INSERT INTO "exemplos" ("visivel", "created_at", "nome", "updated_at", "codigo") VALUES('f', '2009-10-14 14:52:28', 'Exemplo 1 - Fatorial', '2009-10-14 14:52:28', '# Exemplo 1
---
  def create
    @exemplo = Exemplo.new(params[:exemplo])

    respond_to do |format|
      if @exemplo.save

SELECT * FROM "exemplos" WHERE ("exemplos"."id" = 1)
UPDATE "exemplos" SET "updated_at" = '2009-10-14 15:13:53', "visivel" = 't' WHERE "id" = 1
---
  def update
    @exemplo = Exemplo.find(params[:id])

    respond_to do |format|
      if @exemplo.update_attributes(params[:exemplo])