curso/app/controllers/home_controller.rb

SELECT * FROM "exemplos" WHERE (visivel = 0)
---
  def index
    @exemplos = Exemplo.all